Revit 2018 API
MultiReferenceAnnotationOptions Methods
The MultiReferenceAnnotationOptions type exposes the following members.
Methods
Name | Description
Dispose
ElementsMatchReferenceCategory
 Verifies that all of the elements match the reference category required by the MultiReferenceAnnotationType.
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetElementsToDimension
 Gets the elements which the dimension will witness.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsAllowedDimensionStyleType
 Only Linear and LinearFixed dimension style types are allowed for new MultiReferenceAnnotations.
SetElementsToDimension
 Sets the elements which the dimension will witness.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
MultiReferenceAnnotationOptions Class
Autodesk.Revit.DB Namespace